Now it hangs for a long time


I upgraded the aws provider from 2.7.0 to 2.30.0
```
$ rm terraform.tfstate* .terraform
$ terraform.exe init

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.30.0...

$ terraform.exe apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.terraform will be created
  + resource "aws_kms_key" "terraform" {
      + arn                 = (known after apply)
      + description         = "This key is used to encrypt/decrypt S3 bucket for terraform objects"
      + enable_key_rotation = false
      + id                  = (known after apply)
      + is_enabled          = true
      + key_id              = (known after apply)
      + key_usage           = (known after apply)
      + policy              = (known after apply)
    }

  # aws_s3_bucket.terraform will be created
  + resource "aws_s3_bucket" "terraform" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "terraform"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # aws_s3_bucket_public_access_block.terraform will be created
  + resource "aws_s3_bucket_public_access_block" "terraform" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_kms_key.terraform: Creating...
aws_kms_key.terraform: Creation complete after 1s [id=a23935d4-6554-4940-a890-84ea3a363293]
aws_s3_bucket.terraform: Creating...
aws_s3_bucket.terraform: Still creating... [10s elapsed]
...
aws_s3_bucket.terraform: Still creating... [4m50s elapsed]

Error: Error creating S3 bucket: Error creating S3 bucket terraform, retrying: OperationAborted: A conflicting conditional operation is currently in progress against this resource. Please try again.
        status code: 409, request id: ..., host id: ...
  on s3.tf line 5, in resource "aws_s3_bucket" "terraform":
   5: resource "aws_s3_bucket" "terraform" {
```
